[
    {
        "id": 1,
        "title": "Stage",
        "description": "Une superbe application android, Animiru est l'application révé pour tout fan d'animé ! Cette aplication permet de retrouvé à quel épisode nous nous sommes arreté dans notre visionnage !",
        "AC": [
            {
                "code": "AC34.04",
                "description": "Concevoir et développer des composants logiciels, plugins ou extensions",
                "justification": "J'ai utilisé Blazor durant mon stage, ce framework permet d'utiliser des composants. L'entreprise avait un projet interne 'Common-Blazor' ausuel j'ai participé. J'ai donc eu l'occasion de développer des composant dans ce cadre là"
            },
            {
                "code": "AC34.01",
                "description": "Développer à l’aide d’un framework de développement côté serveur",
                "justification": "Lors de mon stage, j'ai eu l'occasion d'utiliser Blazor qui est un FrameWork développé par Microsoft qui peut aussi bien être de coté client ou serveur"
            }
        ],
        "Situation": "",
        "tache": "",
        "action": "",
        "auto-eval": "",
        "images": [
            "./img/Animation - Copie (2).gif"
        ]
    },
    {
        "id": 2,
        "title": "Giv'Up !",
        "description": "Une application web de quizz se jouant de 2 à 4 joueurs. Le jeu se déroule en tour par tour. Le premier joueur commence avec un mini-jeu aléatoire. Il y a 4 mini-jeux différents : Un puzzle, une timeline, Un jeu où il faut associer la pochette à l'artiste correspondant. Ces trois premiers mini-jeux se jouent en solo. Le quatrième mini-jeu se joue avec tous les participants. Le but est de retrouver la musique après que les paroles aient été traduites en anglais (si elles sont en français) ou en français (si elles sont dans une autre langue). Pour répondre, il faut buzzer en utilisant les touches du clavier. A la fin la personne qui a marque le plus de point gagne",
        "AC": [
            {
                "code": "AC34.02",
                "description": "Développer des dispositifs interactifs sophistiqués",
                "justification": "Afin de rendre nos jeux intérrésant et amusant, il était absolument nécessaire d'ajouter de l'interactiviter. Nos joueurs peuvent déplacer des éléments sur l'écran ou même utiliser des buzzers"
            },
            {
                "code": "AC34.01",
                "description": "Développer à l’aide d’un framework de développement côté client",
                "justification": "Pour ce projet nous avons utilisé le framework 'React JS' qui est agis coté client."
            },
            {
                "code": "AC35.02",
                "description": "Maîtriser la qualité en projet Web ou multimédia",
                "justification": "Afin de réaliser la meilleur des applications nous avons procéder à des tests. Ces tests ont été réaliser par l'ensemble de la classe. Notre but était de trouver les bugs que pouvais avoir l'application ou des problèmes d'ergonomie"
            }
        ],
        "Situation": "Objectif :  Faire un projet sur le théme de la musique, Idée : Quizz lier a la musique.",
        "tache": [
            "1.Créer le déroulement du quizz ",
            "2.Chercher des bonnes idées de mini-jeux",
            "3.Faire le maquettage",
            "4.Créer les différents minis jeux"
        ],
        "action": "",
        "auto-eval": "Le projet a été vraiment interessant à développer car nous avons tout pensé de A à Z. De plus, je trouve que le quizz est plutôt de qualité même si il manque plus de mini-jeux pour ne pas tomber tout sur la même chose.",
        "images": [
            "./img/GivUp-accueil.png",
            "./img/GivUp-settings.png",
            "./img/GivUp-puzzle.png",
            "./img/GivUp-Relier.png",
            "./img/GivUp-Timeline.png",
            "./img/GivUp-final.png"
        ]
    },
    {
        "id": 3,
        "title": "Entrepreunariat",
        "description": "  ",
        "AC": [
            {
                "code": "AC35.03",
                "description": "Concevoir un projet d’entreprise innovante en définissant le nom",
                "justification": "Nous avons créé une startup avec un modèle d'affaires unique qui répond à un besoin spécifique du marché."
            },
            {
                "code": "AC35.01",
                "description": "Piloter un produit, un service ou une équipe",
                "justification": "Ce projet était axé sur la gestion de projet. Nous devions gérer nos équipes ainsi que respecter des deadlines."
            }
        ],
        "Situation": "",
        "tache": "",
        "action": "",
        "auto-eval": "",
        "images": [
            "https://picsum.photos/200/300",
            "https://picsum.photos/200/300"
        ]
    }
]
